<a href="https://colab.research.google.com/github/kghilothia06/recommender_system/blob/master/recommender_system.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [0]:
movie_title_id = pd.read_csv('/content/drive/My Drive/recommender_system_dataset/Project 8/Movie_Id_Titles')

In [4]:
movie_title_id.shape

(1682, 2)

In [5]:
movie_title_id.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [0]:
movie_rating =  pd.read_csv('/content/drive/My Drive/recommender_system_dataset/Project 8/u.data',sep='\t',names = ['user_id' , 'movie_id' , 'rating' , 'timestamp'])

In [30]:
movie_rating.shape

(100003, 4)

In [31]:
movie_rating.head()

   user_id  movie_id  rating  timestamp
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

dropping timestamp column

In [0]:
movie_rating.drop(['timestamp'],axis=1 , inplace=True)

In [53]:
movie_rating.shape

(100003, 3)

In [37]:
movie_rating.head()

   user_id  movie_id  rating
0        0        50       5
1        0       172       5
2        0       133       1
3      196       242       3
4      186       302       3

In [39]:
movie_rating.describe()

             user_id       movie_id         rating
count  100003.000000  100003.000000  100003.000000
mean      462.470876     425.520914       3.529864
std       266.622454     330.797791       1.125704
min         0.000000       1.000000       1.000000
25%       254.000000     175.000000       3.000000
50%       447.000000     322.000000       4.000000
75%       682.000000     631.000000       4.000000
max       943.000000    1682.000000       5.000000

In [40]:
movie_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 3 columns):
user_id     100003 non-null int64
movie_id    100003 non-null int64
rating      100003 non-null int64
dtypes: int64(3)
memory usage: 2.3 MB

MERGING THE 2 Datasets

In [0]:
movie_rating_combined = pd.merge(movie_rating, movie_title_id  , left_on='movie_id' , right_on = 'item_id')

In [67]:
movie_rating_combined.shape

(100003, 5)

In [68]:
movie_rating_combined.head()

   user_id  movie_id  rating  item_id             title
0        0        50       5       50  Star Wars (1977)
1      290        50       5       50  Star Wars (1977)
2       79        50       4       50  Star Wars (1977)
3        2        50       5       50  Star Wars (1977)
4        8        50       5       50  Star Wars (1977)

In [0]:
movie_rating_combined.drop(['item_id'] , axis= 1, inplace=True)

In [73]:
movie_rating_combined.shape

(100003, 4)